<title> Андриянов Максим ПИ-322</title>
<p>Вариант 1 и 13
</p>
<?php
  $a=rand(-20,20);
  $b=rand(-20,20);
  $c=rand(-20,20);
  $d=rand(-20,20);
  print('Вариант 1 <br>');
  print ('$a=' . $a . '<br>' . '$b=' . $b . '<br>' . '$c=' . $c . '<br>' . '$d=' . $d . '<br>');
  print ('Функция равна: ' . (2*$c - $d)/(($a/4)-1) . '<br>');
  print ('Функция равна: (' . 2 . '*' . $c . ' - ' . $d . ')/((' . $a . '/4)-1) <br> <br>');
  print('Вариант 13 <br>');
  print ('$a=' . $a . '<br>' . '$b=' . $b . '<br>' . '$c=' . $c . '<br>' . '$d=' . $d . '<br>');
  print ('Функция равна: ' . $c*($b+23)/(($a/2)-4*$d-1) . '<br>');
  print ('Функция равна: ' . $c . '*(' . $b . '+23)/((' . $a . '/2)-4*' . $d . '-1)');

?>